<img src="images/pandas-intro.png">

# Learning Agenda of this Module:
- What is Pandas and how is it used in AI?
- Key features of Pandas
- Data Types in Pandas
- What does Pandas deal with?

- Creating Series in Pandas
    - From Python List
    - From NumPy Arrays
    - From Python Dictionary
    - From a scalar value
    - Creating empty series object
- Attributes of a Pandas Series
- Arithmetic Operations on Series

- Dataframes in Pandas
    - Anatomy of a Dataframe
    - Creating Dataframe
        - An empty dataframe
        - Two-Dimensional NumPy Array
        - Dictionary of Python Lists
        - Dictionary of Panda Series
    - Attributes of a Dataframe
    - Bonus
- Different file formats in Pandas 
- Indexing, Subsetting and Slicing Dataframes
    - Practice Exercise I
- Modifying Dataframes
- Data Handling with Pandas
  - Practice Exercise I
  - Practice Exercise II
- All Statistical functions in Pandas
- Input/Output Operations
- Aggregation & Grouping
  - Practice Exercise
- Merging, Joining and Concatenation
  - Practice Exercise
- How To Perform Data Visualization with Pandas
- Exercise I
- Exercise II
- Pandas's Assignment

## Learning agenda of this notebook

**PART-I: (Merging and Joining)**
1. Merging DataFrames using `pd.merge()` method
   - Perform **Inner Join** (which is default)
   - Peform **Outer**/**Full Outer Join**
   - Perform **Left Outer Join**
   - Perform **Right Outer Join**<br><br>
2. Additional Parameters to `pd.merge()` Method  
   - Use of `indicator` parameter to indicate the df to which the value belong
   - Use of `suffixes` parameter to differentiate between common column labels
   - Use of `validate` parameter to check for duplicate keys
   
**PART-II: (Concatenating and Appending)**    

3. Row wise Concatenation using `pd.concat()`

4. Column wise Concatenation using `pd.concat()`

5. Adding a Single Row/Column in a Dataframe using `pd.concat()`

6. Appending Dataframes using `df.append()`

# Part-I (Merging and Joining)

## 1. Merging DataFrames using `pd.merge()` Method
Pandas `pd.merge()` is a versatile method to perform all standard database join operations between DataFrame or named Series objects.

```
pd.merge(left, right, how="inner", indicator=False, on=None, suffixes=("_x", "_y"), validate=None)
```
Where,
- **`left`:** A DataFrame or named Series object.
- **`right`:** Another DataFrame or named Series object.
- **`how`:** specifies the type of join {`inner`, `outer`, `left`, `right`} (default is `inner`)
- **`on`:** Column or index level names to join on. Must be found in both the left and right DataFrame and/or Series objects. 
- **`indicator`:** If set to True, adds a column to the output DataFrame called **`_merge`** with information on the source of each row {`left_only` means, this element is present only in left Dataframe, `right_only` means this is present only in right dataframe, `both` means they are present in both
- **`suffixes`:** A tuple of string suffixes to apply to overlapping columns. Defaults to ('_x', '_y').
- **`validate`:** If specified, checks for uniqueness of keys. This parameter can take following four values (default is None):
    - “one_to_one” or “1:1”: checks if merge keys are unique in both left and right datasets.
    - “one_to_many” or “1:m”: checks if merge keys are unique in left dataset.
    - “many_to_one” or “m:1”: checks if merge keys are unique in right dataset.
    - “many_to_many” or “m:m”: allowed, but does not result in checks.

### a. Inner  Join:

It is the most common type of join you’ll be working with. It returns a dataframe with only those rows that have common characteristics.
An inner join requires each row in the two joined dataframes to have matching column values. This is similar to the intersection of two sets.

<img align="center" width="900" height="600"  src="images/join-inner.png"  >

In [2]:
# Let us create a simple data frame
import pandas as pd

# This dataframe doesn't have entry for Lahore
df_temp = pd.DataFrame({
    'city': ['Lahore', 'Muree', 'Peshawer', 'Sialkot'],
    'temperature' : [39, 14, 29, 32],
})
df_temp

       city  temperature
0    Lahore           39
1     Muree           14
2  Peshawer           29
3   Sialkot           32

In [3]:
import pandas as pd

# This Dataframe has an extra entry for Multan
df_hum = pd.DataFrame({
    'city': [ 'Karachi', 'Lahore', 'Peshawer', 'Lahore', 'Muree'],
    'humidity' : [76, 95, 72, 70, 75],
})
df_hum

       city  humidity
0   Karachi        76
1    Lahore        95
2  Peshawer        72
3    Lahore        70
4     Muree        75

**Note the column `city` on which we want to perform an inner join, in the two dataframes has only four cities in common. So the resulting dataframe will have only four rows that are common in both dataframes**

In [4]:
d1 = pd.merge(df_temp, df_hum, how='inner')
d1

       city  temperature  humidity
0    Lahore           39        95
1    Lahore           39        70
2     Muree           14        75
3  Peshawer           29        72

In [5]:
# merge will perform only for those cities that are common in both, which means it by-default performs inner-join
d1 = pd.merge(df_temp, df_hum, on='city', how = 'inner', indicator=True)
d1

       city  temperature  humidity _merge
0    Lahore           39        95   both
1    Lahore           39        70   both
2     Muree           14        75   both
3  Peshawer           29        72   both

In [6]:
# Note only the sequence of o/p dataframe changes once we change the order in case of inner join
d1 = pd.merge(df_hum, df_temp, on='city', how = 'inner', indicator=True)
d1

       city  humidity  temperature _merge
0    Lahore        95           39   both
1    Lahore        70           39   both
2  Peshawer        72           29   both
3     Muree        75           14   both

### b. Full Join:
Also known as Full Outer Join, returns all those records which either have a match in the left or right dataframe. This is similar to the union of two sets.

<img align="center" width="900" height="600"  src="images/join-fullouter.png"  >

In [7]:
df_temp = pd.DataFrame({
    'city': ['Lahore', 'Muree', 'Peshawer', 'Sialkot'],
    'temperature' : [39, 14, 29, 32],
})
df_temp

       city  temperature
0    Lahore           39
1     Muree           14
2  Peshawer           29
3   Sialkot           32

In [8]:
df_hum = pd.DataFrame({
    'city': [ 'Karachi', 'Lahore', 'Peshawer', 'Lahore', 'Muree'],
    'humidity' : [76, 95, 72, 70, 75],
})
df_hum

       city  humidity
0   Karachi        76
1    Lahore        95
2  Peshawer        72
3    Lahore        70
4     Muree        75

**Note the column `city` on which we want to perform a full outer join, in the two dataframes has a union of  seven cities. So the resulting dataframe will have seven rows**

In [9]:
d2 = pd.merge(df_temp, df_hum, on='city', how='outer', indicator=True)
d2

       city  temperature  humidity      _merge
0    Lahore         39.0      95.0        both
1    Lahore         39.0      70.0        both
2     Muree         14.0      75.0        both
3  Peshawer         29.0      72.0        both
4   Sialkot         32.0       NaN   left_only
5   Karachi          NaN      76.0  right_only

In [10]:
# Note only the sequence of o/p dataframe changes once we change the order in case of inner join
d3 = pd.merge(df_hum, df_temp, on='city', how='outer', indicator=True)
d3

       city  humidity  temperature      _merge
0   Karachi      76.0          NaN   left_only
1    Lahore      95.0         39.0        both
2    Lahore      70.0         39.0        both
3  Peshawer      72.0         29.0        both
4     Muree      75.0         14.0        both
5   Sialkot       NaN         32.0  right_only

###  c. Left Join
Also known as Left outer join. It is simply performs an inner join plus all the non-matching rows of the left dataframe are taken as it is filled with NaN for columns of the right dataframe.

<img align="center" width="900" height="600"  src="images/join-leftouter.png"  >

In [11]:
df_temp = pd.DataFrame({
    'city': ['Lahore', 'Muree', 'Peshawer', 'Sialkot'],
    'temperature' : [39, 14, 29, 32],
})
df_temp

       city  temperature
0    Lahore           39
1     Muree           14
2  Peshawer           29
3   Sialkot           32

In [12]:
df_hum = pd.DataFrame({
    'city': [ 'Karachi', 'Lahore', 'Peshawer', 'Lahore', 'Muree'],
    'humidity' : [76, 95, 72, 70, 75],
})
df_hum

       city  humidity
0   Karachi        76
1    Lahore        95
2  Peshawer        72
3    Lahore        70
4     Muree        75

**Note the column `city` on which we want to perform a left outer join, in the two dataframes has an intersection of four rows. Other than these four rows, record of city Sialkot from left dataframe will also be included in the resulting dataframe being a left outer join**

In [13]:
# In left outer join, it takes all the rows from left dataframe and only common rows from right dataframe
d3 = pd.merge(df_temp, df_hum, on='city', how='left', indicator=True)
d3

       city  temperature  humidity     _merge
0    Lahore           39      95.0       both
1    Lahore           39      70.0       both
2     Muree           14      75.0       both
3  Peshawer           29      72.0       both
4   Sialkot           32       NaN  left_only

**Left and right outer join also depend on the order of Dataframes that are passed to merge() function. Let us change the order and understand this**

In [14]:
d4 = pd.merge(df_hum, df_temp, on='city', how='left', indicator=True)
d4

       city  humidity  temperature     _merge
0   Karachi        76          NaN  left_only
1    Lahore        95         39.0       both
2  Peshawer        72         29.0       both
3    Lahore        70         39.0       both
4     Muree        75         14.0       both

### d. Right  Join
Also known as Right outer join. It is simply performs an inner join plus  all the non-matching rows of the right dataframe are taken as it is filled with NaN for columns of the left dataframe.

<img align="center" width="900" height="600"  src="images/join-rightouter.png"  >

In [15]:
df_temp = pd.DataFrame({
    'city': ['Lahore', 'Muree', 'Peshawer', 'Sialkot'],
    'temperature' : [39, 14, 29, 32],
})
df_temp

       city  temperature
0    Lahore           39
1     Muree           14
2  Peshawer           29
3   Sialkot           32

In [16]:
df_hum = pd.DataFrame({
    'city': [ 'Karachi', 'Lahore', 'Peshawer', 'Lahore', 'Muree'],
    'humidity' : [76, 95, 72, 70, 75],
})
df_hum

       city  humidity
0   Karachi        76
1    Lahore        95
2  Peshawer        72
3    Lahore        70
4     Muree        75

**Note the column `city` on which we want to perform a right outer join, in the two dataframes has an intersection of four rows. Other than these four rows, record of city Karachi from right dataframe will also be included in the resulting dataframe being a right outer join**

In [17]:
# In Right outer join, it takes all the rows from Right dataframe and only common rows from left dataframe
df3 = pd.merge(df_temp, df_hum, on='city', how='right', indicator=True)
df3

       city  temperature  humidity      _merge
0   Karachi          NaN        76  right_only
1    Lahore         39.0        95        both
2  Peshawer         29.0        72        both
3    Lahore         39.0        70        both
4     Muree         14.0        75        both

**Left and right outer join also depend on the order of Dataframes that are passed to merge() function. Let us change the order and understand this**

In [18]:
df4 = pd.merge(df_hum, df_temp, on='city', how='right', indicator=True)
df4

       city  humidity  temperature      _merge
0    Lahore      95.0           39        both
1    Lahore      70.0           39        both
2     Muree      75.0           14        both
3  Peshawer      72.0           29        both
4   Sialkot       NaN           32  right_only

## 2. Additional Parameters to `pd.merge()` Method

####  Use of `suffixes` Parameter
- When you merge dataframes having columns with same labels, other than the one on which you are joining ('city`)
- The resulting dataframe will have appended suffixes (`_x`, `_y`) with column labels to differentiate b/w columns of both dataframes
- For better understanding you can pass `suffixes`.....
- Let us understand this by example

In [19]:
df1 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer'],
    'temperature' : [35, 39, 33],
    'humidity' : [76, 95, 72]
})

df1

       city  temperature  humidity
0    Lahore           35        76
1   Karachi           39        95
2  Peshawer           33        72

In [20]:
df2 = pd.DataFrame({
    'city': [ 'Karachi', 'Peshawer', 'Islamabad'],
    'temperature' : [41, 44, 47],
    'humidity' : [88, 99, 79]
})
df2

        city  temperature  humidity
0    Karachi           41        88
1   Peshawer           44        99
2  Islamabad           47        79

In [21]:
df3 = pd.merge(df1, df2, on='city', how='inner')
df3

       city  temperature_x  humidity_x  temperature_y  humidity_y
0   Karachi             39          95             41          88
1  Peshawer             33          72             44          99

- **Note that `merge` has automatically appended suffixes with column labels to differentiate b/w columns of both dataframes**
- **You can use the `suffixes` parameter to `pd.merge()` method to specify the suffixes other than `_x` and `_y` to something more meaningful.**

In [22]:
d3 = pd.merge(df1, df2, on='city', how='inner', suffixes=('_left','_right'))
d3

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,Karachi,39,95,41,88
1,Peshawer,33,72,44,99

####  Use `validate` Parameter to Check for Duplicate Keys
- We can use the `validate` parameter to the `pd.merge()` method to check for uniqueness of keys. This parameter can take following four values (default is None):
    - `one_to_one` or `1:1`: checks if merge keys are unique in both left and right datasets.
    - `one_to_many` or `1:m`: checks if merge keys are unique in left dataset.
    - `many_to_one` or `m:1`: checks if merge keys are unique in right dataset.
    - `many_to_many` or `m:m`: allowed, but does not result in checks.

In [23]:
df1 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Muree'],
    'temperature' : [35, 39, 15],
})
df1

      city  temperature
0   Lahore           35
1  Karachi           39
2    Muree           15

In [24]:
df2 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Islamabad', 'Lahore'],
    'humidity' : [76, 95, 72, 76],
})
df2

        city  humidity
0     Lahore        76
1    Karachi        95
2  Islamabad        72
3     Lahore        76

>**`one_to_one` or `1:1`: checks if merge keys are unique in both left and right dataframes, if not then throw exception**

In [25]:
df1, df2

(      city  temperature
 0   Lahore           35
 1  Karachi           39
 2    Muree           15,
         city  humidity
 0     Lahore        76
 1    Karachi        95
 2  Islamabad        72
 3     Lahore        76)

In [26]:
pd.merge(df1, df2, on='city', how='outer', validate='one_to_one')

MergeError: Merge keys are not unique in right dataset; not a one-to-one merge

>**`one_to_many` or `1:m`: checks if merge keys are unique in left dataframe, if not then throw exception**

In [27]:
df1, df2

(      city  temperature
 0   Lahore           35
 1  Karachi           39
 2    Muree           15,
         city  humidity
 0     Lahore        76
 1    Karachi        95
 2  Islamabad        72
 3     Lahore        76)

In [28]:
pd.merge(df1, df2, on='city', how='outer', validate='one_to_many')

        city  temperature  humidity
0     Lahore         35.0      76.0
1     Lahore         35.0      76.0
2    Karachi         39.0      95.0
3      Muree         15.0       NaN
4  Islamabad          NaN      72.0

>**`many_to_one` or `m:1`: checks if merge keys are unique in right dataframe, if not then throw exception**

In [29]:
df1, df2

(      city  temperature
 0   Lahore           35
 1  Karachi           39
 2    Muree           15,
         city  humidity
 0     Lahore        76
 1    Karachi        95
 2  Islamabad        72
 3     Lahore        76)

In [30]:
pd.merge(df1, df2, on='city', how='outer', validate='many_to_one')

MergeError: Merge keys are not unique in right dataset; not a many-to-one merge

>**`many_to_many` or `m:m`: No checks are performed on keys uniqueness**

In [31]:
df1

      city  temperature
0   Lahore           35
1  Karachi           39
2    Muree           15

In [32]:
df2

        city  humidity
0     Lahore        76
1    Karachi        95
2  Islamabad        72
3     Lahore        76

In [35]:
pd.merge(df1, df2, on='city', how='outer', validate='many_to_many', indicator=True)

        city  temperature  humidity      _merge
0     Lahore         35.0      76.0        both
1     Lahore         35.0      76.0        both
2    Karachi         39.0      95.0        both
3      Muree         15.0       NaN   left_only
4  Islamabad          NaN      72.0  right_only

In [34]:
pd.merge(df1, df2, on='city', how='inner', validate='many_to_many')

      city  temperature  humidity
0   Lahore           35        76
1   Lahore           35        76
2  Karachi           39        95

# Part-II (Concatenating and Appending)

## Concatenation of  DataFrames (Row Wise + Column Wise)

<img align="left" width="350" height="90"  src="images/row.PNG"  >
<img align="right" width="490" height="100"  src="images/concat_2.png" >

<br><br><br><br><br><br><br><br><br><br>


- The `pd.concat()` method is used to concat pandas objects along a particular axis with optional set logic along the other axes. 
```
pd.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, verify_integrity=False)
```

Where,
- `objs`: a sequence or mapping of Series or DataFrame objects
- `axis`: The axis to concatenate along. {0/’index’, 1/’columns’}, default 0
- `join`{‘inner’, ‘outer’}, Default is `outer` for union. If `inner` that means intersection
- `ignore_index`: If True, the resulting axis will be labeled 0, …, n - 1. This is useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information. (default is False)
- `keys`: sequence, default None (Construct hierarchical index using the passed keys as the outermost level.)
- `verify_integrity` : boolean, default False. Check whether the new concatenated axis contains duplicates. This can be very expensive relative to the actual data concatenation.

## 3. Row-Wise Concatenation
<img align="left" width="350" height="90"  src="images/row.PNG"  >

In [ ]:
import pandas as pd
Pak_Weather = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [35, 39, 33, 29, 15],
    'humidity' : [76, 95, 72, 81, 70],
})
Pak_Weather

In [ ]:
UAE_Weather = pd.DataFrame({
    'city': [ 'Dubai', 'Sharja', 'Ajman', 'Abu Dhabi'],
    'temperature' : [41, 44, 47, 45],
    'humidity' : [88, 99, 79, 86],
})
UAE_Weather

In [ ]:
df1 = pd.concat([Pak_Weather, UAE_Weather], join='outer' )
df1

#### Concatenate Dataframes (row-wise)

In [ ]:
df1 = pd.concat([Pak_Weather, UAE_Weather])
df1 = pd.concat([Pak_Weather, UAE_Weather], axis=0)
df1

- Notice the index is also concatenated as such
- To handle this pass `ignore_index` parameter a value of `True`, so that the resulting axis is be labeled 0, …, n - 1. 
- Useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information.
- Note the index values on the other axes (i.e., columns) have still respected in the join.

In [ ]:
df2 = pd.concat([Pak_Weather,UAE_Weather], axis=0, ignore_index=True)
df2

- Other than the numeric index, if you want to have an additional index for your sub groups, you can use the `keys` argument to `pd.concat()` method
- It provides multi-indexing
- Remember this will work only if the `ignore_index` argument is `False` which is the default

In [ ]:
df3 = pd.concat([Pak_Weather, UAE_Weather], axis=0, keys=["city",])
df3

In [ ]:
df3 = pd.concat([Pak_Weather, UAE_Weather], axis=0, keys=["Pak", "UAE"])
df3

In [ ]:
df3.index

- The advantage of doing this is you can use `df.loc` to get a subset of your dataframe
- So, after getting a big dataframe if you want to get the dataframe from which it was created keys arg is useful

In [ ]:
df3.loc['Pak', :]

In [ ]:
df3.loc['UAE', :]

#### What will Happen if one of the Dataframe has an Additional Column
- If you combine two Dataframe objects which do not have all the same columns, then the columns outside the intersection will be filled with NaN values.

In [ ]:
Pak_Weather = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [35, 39, 33, 29, 15],
    
})
Pak_Weather

In [ ]:
UAE_Weather = pd.DataFrame({
    'city': [ 'Dubai', 'Sharja', 'Ajman', 'Abu Dhabi'],
    'temperature' : [41, 44, 47, 45],
    'humidity' : [88, 99, 79, 86],
})
UAE_Weather

In [ ]:
# NaN will be placed where values are missing
df = pd.concat([Pak_Weather,UAE_Weather], axis=0, ignore_index=True)
df

## 4. Column Wise Concatenation
- It is not advised to concatenate dataframes column wise. If you want to then you need to take care of some checks like:
    - the number of rows must be same in both dataframes, and
    - Indexes of both dataframes are sorted
- If you are done with all the checks then you can simply use `axis=1` to do the job.

<img align="left" width="490" height="100"  src="images/concat_2.png"  >

### a. Creating a two Simple Dataframe

In [ ]:
temp_df = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [35, 39, 33, 29, 15],
})
temp_df

In [ ]:
wind_df = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'wind speed' : [9, 12, 7, 13, 18],
})
wind_df

### b. Concatenate Dataframes (column-wise)

In [ ]:
# We have to use the argument axis=1
df = pd.concat([temp_df,wind_df], axis=1)
df

### c. What will happen if we have missing data in our dataframes

In [ ]:
# This dataframe do not have the temperature for Lahore
temp_df = pd.DataFrame({
    'city': [ 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [39, 33, 29, 15],
})
temp_df

In [ ]:
#This dataframe do not have the windspeed of Islamabad
wind_df = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Muree'],
    'wind speed' : [9, 12, 7, 18],
})
wind_df

In [ ]:
df1 = pd.concat([temp_df,wind_df], axis=1)
df1

**This doesnot look correct**
- We have missing data in the resulting dataframe, i.e., it does not contain record for Lahore, which was there in the second dataframe but not in the first
- Solution is while creating the dataframe you pass it the index
- In Pandas, while creating a DataFrame, you can pass the index argument with appropriate related indices, which is a way to align rows from different dataframes

In [ ]:
# This dataframe do not have the temperature for Lahore
temp_df = pd.DataFrame({
    'city': [ 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [39, 33, 29, 15],
},index=[0,1,2,3])
temp_df

In [ ]:
#This dataframe do not have the windspeed of Islamabad
# Note the indices in wind_df are related to indices of temp_df
wind_df = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Muree'],
    'wind speed' : [9, 12, 7, 18],
}, index=[4,0,1,3])
wind_df

---
#### Note the indexes in above two dataframes match. Now concatenation will be OK
---

In [ ]:
df = pd.concat([temp_df,wind_df], axis=1)
df

>- Concatenating Dataframes along axis = 1 adds one Dataframe along the other. It is like a full outer join. Placing NaN for non-matching rows in the left as well as right Dataframes.
>- By default, a concatenation results in a set union, where all data is preserved.

## 5. Adding a Single Row/Column in a Dataframe
- Now let us see how we can concat a single row or a single column to a dataframe using the `pd.concat()` method.

### a. Adding a Row in a Dataframe

In [ ]:
df1 = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [35, 39, 33, 29, 15],
    'humidity' : [76, 95, 72, 81, 70],
})
df1

In [ ]:
df2 = pd.DataFrame({"city": "Multan", "temperature": 45, "humidity": 75}, index=[5])
df2

In [ ]:
df3 = pd.concat([df1, df2], ignore_index=True, axis = 0)
df3

>**You can place the new row at your desired location using slicing operator, as shown below**

In [ ]:
df3 = pd.concat([df1[:2], df2, df1[2:]], ignore_index = True)
df3

### b. Adding a Column in a Dataframe

In [ ]:
Pak_Weather = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [35, 39, 33, 29, 15],
    'humidity' : [76, 95, 72, 81, 70],
})
Pak_Weather

In [ ]:
s = pd.Series(["Humid", 'Dry', 'Rainy', 'Humid', 'Rainy'], name="event")
s

In [ ]:
df = pd.concat([Pak_Weather, s], axis=1)
df

<img align="right" width="310" height="100"  src="images/append.png"  >

## 6. Appending DataFrames
- The `df1.append(df2)` method is used to concat the second dataframe’s records at the end of first dataframe (along axis=0). Columns not present in the first DataFrame are added as new columns
- The `df1.append(df2)` method considers the calling dataframe as main object and adds rows to that dataframe from the dataframes that are passed to the function as argument.
- It returns a new dataframe object consisting of the rows of caller and the rows of `other`. The dataframe that called the `append()` method,  remain unchanged.
```
df.append(other, ignore_index=False, verify_integrity=False, sort=False)
```

    - `other`: DataFrame or Series/dict-like object, or list of these (The data to append.)
    - `ignore_index`: If True, the resulting axis will be labeled 0, 1, …, n - 1 (default is False)
    - `verify_integrity`: If True, raise ValueError on creating index with duplicates (default is False)
    - `sort`: Sort columns if the columns of `self` and `other` are not aligned (default is False)

### a. Append Two DataFrames

In [ ]:
Pak_Weather = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [35, 39, 33, 29, 15],
    'humidity' : [76, 95, 72, 81, 70],
})
Pak_Weather

In [ ]:
UAE_Weather = pd.DataFrame({
    'city': [ 'Dubai', 'Sharja', 'Ajman', 'Abu Dhabi'],
    'temperature' : [41, 44, 47, 45],
    'humidity' : [88, 99, 79, 86],
})
UAE_Weather

In [ ]:
# append Dataframe
df2 =  Pak_Weather.append(UAE_Weather)
df2

- Notice the index is also concatenated as such
- To handle this pass `ignore_index` parameter a value of `True`, so that the resulting axis is be labeled 0, …, n - 1. 
- Useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information.

In [ ]:
# set the ignore_index to true
df2 =  Pak_Weather.append(UAE_Weather, ignore_index=True)
df2

### b. Append a Row in DataFrame

In [ ]:
Pak_Weather = pd.DataFrame({
    'city': [ 'Lahore', 'Karachi', 'Peshawer', 'Islamabad', 'Muree'],
    'temperature' : [35, 39, 33, 29, 15],
    'humidity' : [76, 95, 72, 81, 70],
})
Pak_Weather

In [ ]:
# Creating a row to be appended
d1 = pd.DataFrame({"city": "Multan", "temperature": 45, "humidity": 75}, index=[5])
d1

In [ ]:
# Append this dataframe having single row to Pak_Weather dataframe
df3 =  Pak_Weather.append(d1)
df3

**Columns of passed/other dataframe that are not in the caller are added as new columns**

In [ ]:
d1 = pd.DataFrame({"city": "Sialkot", "temperature": 45, "humidity": 75, "newcol": 66}, index=[5])
d1

In [ ]:
df3 =  Pak_Weather.append(d1)
df3

## Practice Exercise no 01

### Introduction:
#### Housing Market
This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [ ]:
series1 =pd.Series(np.random.randint(1,5,100))
series2 =pd.Series(np.random.randint(1,4,100))
series3 =pd.Series(np.random.randint(10000,30001,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [ ]:
df = pd.concat([series1,series2,series3], axis=1)
df.head()

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [ ]:
df = df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'})
df.head()

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [ ]:
bigcolumn = pd.concat([series1,series2,series3], axis=0)
bigcolumn.head()

# # it is still a series, we need to transform it into dataframe
bigcolumn = bigcolumn.to_frame()
bigcolumn

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [ ]:
# # No it is not true, the length of dataframe of 300
# len(bigcolumn)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [ ]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

## Practice Exercise no 02

### Introduction:

#### Fictitious Names
This time you will create a data again 
In order to understand about it go to [here](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/).

### Step 1. Import the necessary libraries

In [ ]:
# import pandas as pd
# import numpy as np

### Step 2. Create the 3 DataFrames based on the following raw data

In [ ]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### Step 3. Assign each to a variable called data1, data2, data3

In [ ]:
data1 = pd.DataFrame(raw_data_1)
data2 = pd.DataFrame(raw_data_2)
data3 = pd.DataFrame(raw_data_3)

### Step 4. Join the two dataframes(data1, data2) along rows and assign  to all_data

In [ ]:
all_data = pd.concat([data1,data2])
all_data.head()

### Step 5. Join the two dataframes along columns and assing to all_data_col

In [ ]:
all_data_col = pd.concat([data1,data2],axis=1)
all_data_col

### Step 6. Print data3

In [ ]:
data3

### Step 7. Merge `all_data` and `data3` along the `subject_id` value.

In [ ]:
pd.merge(all_data, data3, on='subject_id')

### Step 8. Merge only the data that has the same 'subject_id' on both data1 and data2

In [ ]:
pd.merge(data1,data2,on='subject_id', indicator=True)

### Step 9. Merge all values in data1 and data2 along subject_id, with matching records from both sides where available.

In [ ]:
pd.merge(data1,data2,on='subject_id', how='outer', indicator=True)

## Practice Exercise no 03

### Introduction:
#### MPG Cars

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/cars1.csv) and [cars2](https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/cars2.csv).

In [ ]:
url1 = "https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/cars1.csv"
url2 = "https://raw.githubusercontent.com/bsef19m521/DatasetsForProjects/master/cars2.csv"

In [ ]:
car1 = pd.read_csv(url1)
car2 = pd.read_csv(url2)

In [ ]:
car1.head()

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [ ]:
car1 = car1.loc[:,"mpg":"car"]
car1.head(2)

### Step 5. What is the number of observations in each dataset?

In [ ]:
print("car1.shape : ", car1.shape)
print("car2.shape : ", car2.shape)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [ ]:
cars = pd.concat([car1,car2]).reset_index(drop=True)
cars

In [ ]:
cars.shape

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [ ]:
owners = pd.Series(np.random.randint(15000,73001,398), dtype=np.uint32)
owners

### Step 8. Add the column owners to cars

In [ ]:
cars['owners'] = owners
cars.head(2)

In [ ]:
cars.shape

In [1]:
from IPython.core.display import HTML

style = """
    <style>
        body {
            background-color: #f2fff2;
        }
        h1 {
            text-align: center;
            font-weight: bold;
            font-size: 36px;
            color: #4295F4;
            text-decoration: underline;
            padding-top: 15px;
        }
        
        h2 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #4A000A;
            text-decoration: underline;
            padding-top: 10px;
        }
        
        h3 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #f0081e;
            text-decoration: underline;
            padding-top: 5px;
        }

        
        p {
            text-align: center;
            font-size: 12 px;
            color: #0B9923;
        }
    </style>
"""

html_content = """
<h1>Hello</h1>
<p>Hello World</p>
<h2> Hello</h2>
<h3> World </h3>
"""

HTML(style + html_content)